export type AttrDesc = readonly [
  "str" | "str_arr" | "number" | "bool" | "arr",
  any,
  string,
  string,
  string
]; // 属性描述 [类型,样例值,描述,值范围, 修改规则]

export const person_attr = {
  名称: [
    "str",
    "张三",
    "人名",
    "任意人名即可(符合人名规范)",
    "大部分情况下不能修改",
  ],
  性别: ["str", "男", "性别", "男/女", "不能修改"],
  生日: ["str", "2000-01-01", "生日", "任意日期", "不能修改"],
  身高: ["number", 170, "身高", "cm", "极难修改"],
  体重: ["number", 70, "体重", "kg", "锻炼/事件修改"],
  智商: ["number", 80, "智商", "百分制", "极难修改/大事件修改"],
  体力: ["number", 100, "体力", "百分制,最大100", "锻炼/事件修改"],
  智慧: ["number", 90, "智慧", "百分制,最大100", "极难修改/大事件修改"],
  幸运: ["number", 50, "幸运", "百分制,最大100", "事件修改"],
  性格: [
    "str_arr",
    ["开朗", "善解人意"],
    "性格词条",
    "性格描述词条",
    "大事件修改",
  ],
  职业: ["str", "程序员", "职业", "任意职业", "事件修改"],
  爱好: [
    "str_arr",
    ["滑雪", "FPS游戏"],
    "爱好词条",
    "和身份相关的爱好词条",
    "事件修改",
  ],
  技能: [
    "str_arr",
    ["编程"],
    "技能词条",
    "和身份相关的技能词条",
    "学习/事件修改",
  ],
  身世: [
    "str",
    "北京人, 家境富裕",
    "身世描述, 代表此人的家庭背景",
    "符合设定的身世描述",
    "不能修改",
  ],
  大记忆: [
    "str_arr",
    ["我的领导不错"],
    "大记忆列表, 代表一些重要的事件或事情",
    "此人的任意记忆",
    "较难修改, 只有大事件才会修改",
  ],
  小记忆: [
    "str_arr",
    ["今天工作好多"],
    "小记忆列表, 是一些临时性的事情, 也是思考产物",
    "此人的任意记忆",
    "极易修改, 任何事情都有可能修改记忆",
  ],
  情绪: ["str", "平静", "情绪", "情绪描述", "视用户自身情况修改"],
  关系: [
    "arr",
    [
      {
        name: "李四",
        rel: "好友",
        desc: "他是我一个关系不错的好友",
        stat: "今晚找他吃饭",
      },
    ],
    "与其他人关系的完整情况, name代表关系人, rel代表关系类型, desc代表关系的大致描述, stat代表一些临时的信息",
    "初始应为空; name:全局内其他人名, rel:好友/同事/朋友/敌人/爱慕/憎恨等等任意关系类型, desc:关系详细描述,对对方的整体评价, stat:临时信息, 有关他的一些信息",
    "视交互修改, 可以增加/减少关系, 可以修改关系类型、描述、临时信息",
  ],
} as const satisfies Record<string, AttrDesc>;

export const house_attr = {
  名称: ["str", "幸福小区203", "房子名称", "A市任意房子的名称", "不能修改"],
  地址: [
    "str",
    "北京市海淀区西二旗",
    "房子地址",
    "A市任意房子的地址",
    "不能修改",
  ],
  面积: ["number", 200, "房子面积", "平方米", "不能修改"],
  户型: [
    "str",
    "4室2厅1厨1卫",
    "房子户型, 包括所有房间类型及数量",
    "任意房型",
    "不能修改",
  ],
  朝向: ["str", "南", "房子朝向", "南/北/东/西/等方向值", "不能修改"],
  描述: [
    "str",
    "一个新装修的精品公寓",
    "房子描述, 代表房子特点",
    "合理的房子描述",
    "在一些重大事件时可修改",
  ],
  房间: [
    "arr",
    [],
    "房间列表, 代表房间的名称, 位置, 描述, 物品等信息",
    "初始为空, 后续逐步生成",
    "不能修改",
  ],
} as const satisfies Record<string, AttrDesc>;
export const room_attr = {
  房子: ["str", "幸福小区203", "所属房子名称", "A市任意房子的名称", "不能修改"],
  名称: ["str", "卧室1", "房间名称", "任意住房房间名称", "不能修改"],
  位置: [
    "str",
    "东南角",
    "房间位置, 在房子内何处",
    "南/北/东/西/等方向值",
    "不能修改",
  ],
  描述: [
    "str",
    "一个精致的卧室, 宽敞明亮",
    "房间描述",
    "合理的房间描述",
    "不能修改",
  ],
  物品: [
    "arr",
    [],
    "房间物品列表, 代表房间内的物品名称, 数量, 品质等信息",
    "初始为空, 后续逐步生成",
    "不能修改",
  ],
} as const satisfies Record<string, AttrDesc>;
export const furniture_attr = {
  房间: ["str", "卧室1", "所属房间名称", "房间的名称", "不能修改"],
  名称: ["str", "双人床", "物品名称", "任意物品名称", "不能修改"],
  数量: ["number", 1, "物品数量", "任意数量", "不能修改"],
  品质: ["str", "精致", "物品品质", "任意品质", "不能修改"],
  分布: [
    "str",
    "房间正中央",
    "物品分布",
    "方位+分布情况(大于1个的)",
    "不能修改",
  ],
  描述: [
    "str",
    "白色的双人床, 非常舒服",
    "物品描述",
    "任意物品描述",
    "不能修改",
  ],
} as const satisfies Record<string, AttrDesc>;
